{
  "id": "c12331e6-ff48-4970-a8d9-333b0a199aa6",
  "siteName": "Luxe Lookbook",
  "domainUrl": "lavishlookbook.com",
  "brandingPresets": [
    {
      "presetId": "cb8e0452-ae91-4eda-9dc5-2eaad304dba7",
      "brandIdentity": {
        "designSummary": "The design features a modern dark mode aesthetic with a solid black background that creates a sleek and immersive environment. Vibrant neon green and bright blue accent colors energize the interface, highlighting interactive elements and branding. Typography is geometric, clean, and sans-serif, with large, bold headings that mix white and neon green to emphasize key messages. The layout is spacious and balanced, using a centered column grid with generous negative space and rounded corners on containers and buttons to soften the high-tech feel. The footer employs a modular grid with distinct colored blocks, maintaining visual consistency and clarity. Overall, the design conveys a cutting-edge, digital culture vibe suitable for a gaming or tech conference, combining high contrast, minimalism, and vibrant accents for a friendly yet professional look.",
        "toneOfVoice": "Futuristic, innovative, approachable, and tech-savvy with a casual yet professional personality.",
        "tones": [
          "Futuristic",
          "Innovative",
          "Energetic",
          "Casual",
          "Professional",
          "Tech-savvy",
          "Minimal",
          "High-contrast",
          "Clean",
          "Approachable"
        ],
        "designStyle": {
          "primaryStyle": [
            "Dark Mode",
            "Minimalism",
            "Techno-Futuristic"
          ],
          "supportingStyles": [
            "Geometric",
            "Modular",
            "Neon Accent"
          ]
        },
        "palette": {
          "colors": {
            "primary": "#000000",
            "primaryForeground": "#FFFFFF",
            "secondary": "#2B5FFF",
            "secondaryForeground": "#FFFFFF",
            "background": "#000000",
            "customColors": [
              {
                "name": "accentneongreen",
                "value": "#3EFFB8"
              },
              {
                "name": "accentpeach",
                "value": "#FFCCB3"
              },
              {
                "name": "foreground",
                "value": "#000000"
              },
              {
                "name": "destructive",
                "value": "#DF3131"
              },
              {
                "name": "destructiveforeground",
                "value": "#ffffff"
              }
            ]
          },
          "paletteUsageGuide": "Use the 'primary' black color as the main background to create a sleek, immersive environment. The 'primaryForeground' white color is ideal for main text and icons to ensure maximum readability and contrast. The 'secondary' blue color should be used for branding elements such as color blocks,UI cards, repeters logos and footer backgrounds, paired with 'secondaryForeground' white for text and icons. The 'accentNeonGreen' color is reserved for interactive elements like buttons, badges, and icons to draw user attention and convey energy and innovation. The 'accentPeach' color provides a subtle warm contrast in secondary UI elements such as social media icon backgrounds, balancing the cool palette. Combine these colors thoughtfully to maintain high contrast and accessibility, ensuring that text and interactive elements stand out clearly against backgrounds.",
          "paletteAccessibilityNotes": "The combination of 'primaryForeground' white on 'primary' black background meets WCAG AAA contrast standards for text readability. The 'accentNeonGreen' on black also provides excellent contrast, suitable for buttons and badges. The 'secondaryForeground' white on 'secondary' blue background meets WCAG AA standards for text. The 'accentPeach' on blue background should be used for non-critical elements or icons to maintain sufficient contrast. Overall, the palette supports strong accessibility compliance for text and interactive elements."
        },
        "typography": {
          "headings": {
            "font": {
              "role": "Primary Heading Font",
              "fontFamily": "rubik-v2",
              "fontJustification": ""
            },
            "headingsSimilarFonts": [
              "work-sans-v2",
              "open sans",
              "poppins-v2"
            ],
            "headingsUsageGuide": "Use the heading font in large sizes with bold weight to create impactful titles and section headers. Mix white and 'accentNeonGreen' colors to highlight key words or phrases, enhancing visual hierarchy. Pair headings with paragraph fonts by maintaining clear spacing and contrast. Ensure headings remain legible on dark backgrounds by using 'primaryForeground' or 'accentNeonGreen' colors. Avoid overly condensed or decorative styles to preserve clarity.",
            "headingsAccessibilityNotes": "Headings in 'primaryForeground' white or 'accentNeonGreen' on 'primary' black background meet WCAG AAA contrast standards, ensuring excellent readability for all users."
          },
          "paragraphs": {
            "font": {
              "role": "Main Body Text Font",
              "fontFamily": "rubik-v2",
              "fontJustification": ""
            },
            "paragraphsSimilarFonts": [
              "work-sans-v2",
              "open sans",
              "poppins-v2"
            ],
            "paragraphsUsageGuide": "Use the paragraph font in regular weight and moderate sizes for body text, descriptions, and navigation links. Maintain high contrast by using 'primaryForeground' white on 'primary' black or 'secondary' blue backgrounds. Ensure sufficient line height and letter spacing for comfortable reading. Pair paragraphs with bold headings to create clear content hierarchy. Avoid using accent colors for large blocks of text to maintain readability.",
            "paragraphsAccessibilityNotes": "Paragraph text in 'primaryForeground' white on 'primary' black or 'secondary' blue backgrounds meets WCAG AA or higher contrast standards, supporting accessibility."
          },
          "welcomeSectionTypography": {
            "placement": "Centered",
            "implementation": "The welcome section uses a large, bold heading centered horizontally and vertically within the viewport. The heading text is split with a mix of 'primaryForeground' white and 'accentNeonGreen' colors to emphasize key words. Supporting text is placed below the heading in smaller white font, maintaining strong contrast. Interactive badges and date tags are positioned near the heading with rounded shapes and neon green backgrounds, reinforcing the futuristic theme. The overall typographic placement creates a strong focal point that immediately communicates the event's identity."
          },
          "fontSizes": [
            {
              "name": "xs",
              "size": "0.75rem",
              "lineHeight": "1.2",
              "letterSpacing": "0.02em",
              "fontWeight": "400"
            },
            {
              "name": "sm",
              "size": "0.875rem",
              "lineHeight": "1.3",
              "letterSpacing": "0.02em",
              "fontWeight": "400"
            },
            {
              "name": "base",
              "size": "1rem",
              "lineHeight": "1.5",
              "letterSpacing": "0.025em",
              "fontWeight": "400"
            },
            {
              "name": "lg",
              "size": "1.125rem",
              "lineHeight": "1.5",
              "letterSpacing": "0.025em",
              "fontWeight": "500"
            },
            {
              "name": "xl",
              "size": "1.25rem",
              "lineHeight": "1.5",
              "letterSpacing": "0.03em",
              "fontWeight": "600"
            },
            {
              "name": "2xl",
              "size": "1.5rem",
              "lineHeight": "1.4",
              "letterSpacing": "0.03em",
              "fontWeight": "700"
            },
            {
              "name": "3xl",
              "size": "1.875rem",
              "lineHeight": "1.3",
              "letterSpacing": "0.035em",
              "fontWeight": "700"
            },
            {
              "name": "4xl",
              "size": "2.25rem",
              "lineHeight": "1.2",
              "letterSpacing": "0.04em",
              "fontWeight": "800"
            },
            {
              "name": "5xl",
              "size": "3rem",
              "lineHeight": "1.1",
              "letterSpacing": "0.04em",
              "fontWeight": "800"
            },
            {
              "name": "6xl",
              "size": "3.75rem",
              "lineHeight": "1.1",
              "letterSpacing": "0.045em",
              "fontWeight": "900"
            },
            {
              "name": "7xl",
              "size": "4.5rem",
              "lineHeight": "1.05",
              "letterSpacing": "0.05em",
              "fontWeight": "900"
            },
            {
              "name": "8xl",
              "size": "6rem",
              "lineHeight": "1.05",
              "letterSpacing": "0.05em",
              "fontWeight": "900"
            },
            {
              "name": "9xl",
              "size": "8rem",
              "lineHeight": "1",
              "letterSpacing": "0.06em",
              "fontWeight": "900"
            }
          ]
        },
        "layout": {
          "layoutDna": {
            "densitySpectrum": "Balanced",
            "contrastSpectrum": "High-Contrast",
            "gridAlignmentSpectrum": "Strict Grid",
            "negativeSpaceUsage": "Generous",
            "textVsImageEmphasis": "Text-Focused",
            "complexitySpectrum": "Simple & Clean"
          },
          "grid": {
            "compositionApproach": "Column-based",
            "spacing": {
              "columns": "12-column grid",
              "rows": "Defined content rows",
              "gaps": "Consistent medium gaps"
            },
            "margins": "Generous page margins",
            "padding": "Consistent padding within containers"
          }
        },
        "components": {
          "containers": "Containers have rounded corners with solid backgrounds in black, neon green, blue, or peach depending on context. They maintain consistent padding and spacing, creating modular blocks that organize content clearly. The use of bright accent backgrounds for interactive or navigational containers draws user attention effectively.",
          "images": "Images are minimal or abstract, often replaced by graphic elements or logos. When present, images are framed within rounded containers or circular shapes to maintain design consistency.",
          "buttons": "Buttons are rounded with solid backgrounds in 'accentNeonGreen' or outlined in white. Text on buttons is white or black depending on background for maximum contrast. Buttons have clear hover states and are sized for easy interaction."
        },
        "graphicElements": {
          "icons": "Icons are simple, modern, and use the 'accentNeonGreen' color to stand out against dark backgrounds. They have rounded shapes consistent with the overall design language and are used sparingly to support navigation and calls to action.",
          "illustrations": "No prominent illustrations are used; the design relies on abstract shapes and logos to convey brand identity.",
          "stickers": "Badges and stickers use rounded pill shapes with 'accentNeonGreen' backgrounds and black text, providing clear, friendly labels for event types and dates."
        }
      },
      "originImagesUrls": [
        "https://wixmp-fe53c9ff592a4da924211f23.wixmp.com/uploads/1750335929106-Screenshot%202025-06-05%20at%2015.42.54%201.png"
      ]
    },
    {
      "presetId": "494d7d82-b381-4d83-9c59-6e3828998b8b",
      "brandIdentity": {
        "designSummary": "The design aesthetic is a modern, experimental editorial style that combines bold typography with textured, layered backgrounds. The primary color palette features a deep forest green and bright yellow accents set against muted, textured blue and green backgrounds, creating a high-contrast yet sophisticated visual experience. Typography plays a central role, with large, uppercase geometric sans-serif headings paired with monospaced, typewriter-style body text, emphasizing a tech-forward and innovative tone. The layout is asymmetrical and modular, with generous negative space and overlapping elements that create a dynamic, layered composition. Subtle pixelated and jagged geometric shapes in the background add a tactile, digital texture, reinforcing the brand's focus on innovation and creativity. Overall, the design conveys a bold, intellectual, and approachable personality suitable for cutting-edge design and technology events.",
        "toneOfVoice": "Innovative, bold, intellectual, experimental, and approachable with a tech-savvy edge.",
        "tones": [
          "Innovative",
          "Bold",
          "Intellectual",
          "Experimental",
          "Approachable",
          "Tech-savvy",
          "Sophisticated",
          "Creative",
          "Dynamic",
          "Minimalist"
        ],
        "designStyle": {
          "primaryStyle": [
            "Modern Minimalism",
            "Editorial",
            "Experimental"
          ],
          "supportingStyles": [
            "Tech-Inspired",
            "Digital Texture",
            "Asymmetrical Layout"
          ]
        },
        "palette": {
          "colors": {
            "primary": "#0B4D0B",
            "primaryForeground": "#FFFFFF",
            "secondary": "#F2E94E",
            "secondaryForeground": "#000000",
            "background": "#8A9DC3",
            "customColors": [
              {
                "name": "backgrounddark",
                "value": "#0B3A0B"
              },
              {
                "name": "backgroundlight",
                "value": "#B0C1E2"
              },
              {
                "name": "textblack",
                "value": "#000000"
              },
              {
                "name": "textwhite",
                "value": "#FFFFFF"
              },
              {
                "name": "foreground",
                "value": "#FFFFFF"
              },
              {
                "name": "destructive",
                "value": "#DF3131"
              },
              {
                "name": "destructiveforeground",
                "value": "#FFFFFF"
              }
            ]
          },
          "paletteUsageGuide": "Use the 'primary' color for main headings, navigation links, and key textual elements to establish brand recognition and consistency. The 'secondary' color serves as an accent for highlights, call-to-actions, and important labels, providing vibrant contrast against the 'background' and 'backgroundLight' colors. The 'background' color and its variants ('backgroundLight' and 'backgroundDark') create textured, layered backdrops that add depth without overwhelming content. Text should primarily use 'primary' on lighter backgrounds and 'secondaryForeground' or 'textBlack' on darker backgrounds to ensure readability. The 'primaryForeground' color is reserved for text or icons placed on 'primary' colored backgrounds. Maintain high contrast between text and backgrounds to meet accessibility standards. Avoid mixing 'primary' and 'secondary' colors in close proximity to prevent visual clutter. Instead, use them strategically to guide user attention and create a balanced visual hierarchy.",
          "paletteAccessibilityNotes": "The 'primary' color (#0B4D0B) on the 'background' (#8A9DC3) provides sufficient contrast exceeding WCAG AA standards for large and normal text. The 'secondary' color (#F2E94E) on 'backgroundDark' (#0B3A0B) also meets WCAG AA contrast requirements for text and UI elements. Text in 'primaryForeground' (#FFFFFF) on 'primary' (#0B4D0B) backgrounds achieves excellent contrast for readability. Care should be taken when using 'secondary' on lighter backgrounds to ensure text remains legible, preferably using 'secondaryForeground' (#000000) for text on 'secondary' backgrounds. Overall, the palette supports accessible design with strong contrast pairs for headings, body text, and interactive elements."
        },
        "typography": {
          "headings": {
            "font": {
              "role": "Primary Heading Font",
              "fontFamily": "league spartan",
              "fontJustification": ""
            },
            "headingsSimilarFonts": [
              "montserrat",
              "oswald",
              "anton"
            ],
            "headingsUsageGuide": "Use the 'league spartan' font for all primary headings in uppercase to create strong visual impact and brand presence. Pair with body text fonts to maintain clear hierarchy and readability. Headings should have tight letter spacing and be sized significantly larger than body text to establish emphasis. Use the 'primary' color for headings on light backgrounds and 'primaryForeground' on dark backgrounds to ensure contrast. Avoid mixing heading colors with 'secondary' except for special highlights or callouts.",
            "headingsAccessibilityNotes": "Headings in 'league spartan' with 'primary' color on 'background' meet WCAG AA contrast standards for all sizes. Ensure font sizes for headings are large enough to maintain readability and accessibility."
          },
          "paragraphs": {
            "font": {
              "role": "Main Body Text Font",
              "fontFamily": "azeret-mono",
              "fontJustification": ""
            },
            "paragraphsSimilarFonts": [
              "source code pro",
              "roboto mono",
              "inconsolata"
            ],
            "paragraphsUsageGuide": "Use 'azeret-mono' for body text, captions, and smaller informational text to complement the bold headings with a distinct, tech-savvy character. Text should be left-aligned with comfortable line spacing for readability. Use the 'primary' color for body text on light backgrounds and 'textWhite' or 'secondaryForeground' on darker backgrounds. Avoid using 'secondary' for large blocks of text to maintain legibility. Combine with headings to create a balanced typographic hierarchy that supports scanning and comprehension.",
            "paragraphsAccessibilityNotes": "Body text in 'azeret-mono' with 'primary' color on 'background' meets WCAG AA contrast requirements. Maintain sufficient font size and line height to support accessibility."
          },
          "welcomeSectionTypography": {
            "placement": "Asymmetrical Modular Grid",
            "implementation": "The welcome section uses a large, bold heading placed asymmetrically on the left side of the screen, with supporting text blocks arranged in a modular grid to the right and below. This placement creates a dynamic visual flow that draws attention to the main message while allowing secondary information to be easily scanned. The typography scales responsively, maintaining hierarchy and balance across screen sizes. The use of uppercase for headings and monospaced font for body text reinforces the experimental and tech-forward brand personality."
          },
          "fontSizes": [
            {
              "name": "xs",
              "size": "0.75rem",
              "lineHeight": "1.2",
              "letterSpacing": "0.05em",
              "fontWeight": "400"
            },
            {
              "name": "sm",
              "size": "0.875rem",
              "lineHeight": "1.3",
              "letterSpacing": "0.04em",
              "fontWeight": "400"
            },
            {
              "name": "base",
              "size": "1rem",
              "lineHeight": "1.5",
              "letterSpacing": "0.03em",
              "fontWeight": "400"
            },
            {
              "name": "lg",
              "size": "1.125rem",
              "lineHeight": "1.5",
              "letterSpacing": "0.02em",
              "fontWeight": "500"
            },
            {
              "name": "xl",
              "size": "1.25rem",
              "lineHeight": "1.4",
              "letterSpacing": "0.01em",
              "fontWeight": "600"
            },
            {
              "name": "2xl",
              "size": "1.5rem",
              "lineHeight": "1.3",
              "letterSpacing": "0em",
              "fontWeight": "700"
            },
            {
              "name": "3xl",
              "size": "1.875rem",
              "lineHeight": "1.2",
              "letterSpacing": "-0.01em",
              "fontWeight": "700"
            },
            {
              "name": "4xl",
              "size": "2.25rem",
              "lineHeight": "1.1",
              "letterSpacing": "-0.02em",
              "fontWeight": "800"
            },
            {
              "name": "5xl",
              "size": "3rem",
              "lineHeight": "1.1",
              "letterSpacing": "-0.03em",
              "fontWeight": "900"
            },
            {
              "name": "6xl",
              "size": "3.75rem",
              "lineHeight": "1",
              "letterSpacing": "-0.04em",
              "fontWeight": "900"
            },
            {
              "name": "7xl",
              "size": "4.5rem",
              "lineHeight": "1",
              "letterSpacing": "-0.05em",
              "fontWeight": "900"
            },
            {
              "name": "8xl",
              "size": "6rem",
              "lineHeight": "1",
              "letterSpacing": "-0.06em",
              "fontWeight": "900"
            },
            {
              "name": "9xl",
              "size": "8rem",
              "lineHeight": "1",
              "letterSpacing": "-0.07em",
              "fontWeight": "900"
            }
          ]
        },
        "layout": {
          "layoutDna": {
            "densitySpectrum": "Balanced",
            "contrastSpectrum": "High-Contrast",
            "gridAlignmentSpectrum": "Asymmetrical",
            "negativeSpaceUsage": "Generous",
            "textVsImageEmphasis": "Balanced",
            "complexitySpectrum": "Moderately Complex"
          },
          "grid": {
            "compositionApproach": "Modular with Asymmetrical Alignment",
            "spacing": {
              "columns": "Flexible 12-column grid",
              "rows": "Implicit content rows",
              "gaps": "Variable medium gaps"
            },
            "margins": "Generous page margins",
            "padding": "Consistent padding within containers"
          }
        },
        "components": {
          "containers": "Containers use solid background colors from the palette, primarily 'background' and 'backgroundDark', with generous padding and subtle textured overlays to add depth. They maintain clear separation between content blocks while supporting the layered, modular layout. Borders are minimal or absent, relying on color contrast and spacing for structure.",
          "images": "Images are presented in clean, square frames with no borders, integrated asymmetrically within the layout. They often overlap with text blocks or background shapes, creating a collage-like effect. Images maintain natural colors and contrast well against the muted backgrounds.",
          "buttons": "Buttons use the 'primary' color for solid backgrounds with 'primaryForeground' text for primary actions. Secondary buttons use transparent backgrounds with 'primary' colored borders and text. Hover states invert these colors for clear interactivity feedback. Buttons have sharp edges and minimal padding, consistent with the geometric, modern aesthetic."
        },
        "graphicElements": {
          "icons": "Icons are minimal, monochromatic, and use the 'primary' or 'textBlack' colors. They maintain a simple, geometric style consistent with the typography and overall design language.",
          "illustrations": "No custom illustrations are present; the design relies on photographic content and geometric background shapes for visual interest.",
          "stickers": "No stickers or badges are used in the design, maintaining a clean and uncluttered visual presentation."
        }
      },
      "originImagesUrls": [
        "https://wixmp-fe53c9ff592a4da924211f23.wixmp.com/uploads/1752410156589-Screenshot%202025-07-13%20at%2015.34.11.png"
      ]
    },
    {
      "presetId": "776c1724-d966-4836-b184-c78a4add23f9",
      "brandIdentity": {
        "designSummary": "This design features a refined and minimalistic aesthetic with a strong natural and organic influence. The color palette centers on a warm terracotta primary color paired with a soft cream background, complemented by deep chocolate brown accents. Typography is elegant and serif-based, providing a sophisticated yet approachable tone. The layout employs a modular grid with asymmetrical blocks, balancing images and text with generous negative space for clarity and focus. Buttons and UI elements are minimal and outlined, maintaining subtlety and elegance. Overall, the design conveys a grounded, holistic, and expert brand identity suitable for wellness and alternative therapy websites.",
        "toneOfVoice": "Warm, calm, trustworthy, and professional with a nurturing and holistic personality.",
        "tones": [
          "warm",
          "calm",
          "trustworthy",
          "natural",
          "minimal",
          "sophisticated",
          "organic",
          "grounded",
          "inviting",
          "professional"
        ],
        "designStyle": {
          "primaryStyle": [
            "Minimalism",
            "Natural/Organic"
          ],
          "supportingStyles": [
            "Editorial",
            "Modern Rustic"
          ]
        },
        "palette": {
          "colors": {
            "primary": "#A3521E",
            "primaryForeground": "#F9F6F1",
            "secondary": "#F9F6F1",
            "secondaryForeground": "#2B1F17",
            "background": "#F9F6F1",
            "customColors": [
              {
                "name": "deepbrown",
                "value": "#3B2A20"
              },
              {
                "name": "foreground",
                "value": "#2B1F17"
              },
              {
                "name": "destructive",
                "value": "#DF3131"
              },
              {
                "name": "destructiveforeground",
                "value": "#FFFFFF"
              }
            ]
          },
          "paletteUsageGuide": "Use the 'primary' color predominantly for backgrounds, large blocks, and key accent areas to evoke warmth and earthiness. Text and icons on 'primary' backgrounds should use 'primaryForeground' for optimal contrast and readability. The 'secondary' color serves as the main background for content areas and navigation, providing a soft, clean canvas. Text on 'secondary' backgrounds should use 'secondaryForeground' to maintain legibility and a natural tone. The 'deepBrown' custom color is ideal for overlays, subtle section dividers, or emphasis areas to add depth without overpowering the palette. This palette should be used sparingly and harmoniously to maintain the calm and grounded brand personality, ensuring all text/background combinations meet accessibility standards.",
          "paletteAccessibilityNotes": "The 'primary' color (#A3521E) paired with 'primaryForeground' (#F9F6F1) achieves strong contrast exceeding WCAG AA standards for text and icons. The 'secondary' color (#F9F6F1) with 'secondaryForeground' (#2B1F17) also meets WCAG AA contrast requirements for body text and headings. The 'deepBrown' (#3B2A20) used with 'primaryForeground' or 'secondaryForeground' provides excellent contrast for overlays or text emphasis. Overall, the palette supports accessible reading experiences across all UI elements."
        },
        "typography": {
          "headings": {
            "font": {
              "role": "Primary Heading Font",
              "fontFamily": "playfair display",
              "fontJustification": ""
            },
            "headingsSimilarFonts": [
              "baskervillemtw01-smbdit",
              "didot-w01-italic",
              "cormorantgaramond"
            ],
            "headingsUsageGuide": "Use the heading font for all primary titles and section headers to convey sophistication and trust. Pair with the paragraph font for body text to create a balanced and readable hierarchy. Maintain generous spacing above and below headings to enhance clarity and visual separation. Use 'primary' or 'deepBrown' colors for headings on light backgrounds, and 'primaryForeground' on dark backgrounds to ensure accessibility.",
            "headingsAccessibilityNotes": "Headings using 'primary' or 'deepBrown' colors on 'secondary' backgrounds meet WCAG AA contrast ratios. Large heading sizes ensure readability and accessibility compliance."
          },
          "paragraphs": {
            "font": {
              "role": "Main Body Text Font",
              "fontFamily": "bitter",
              "fontJustification": ""
            },
            "paragraphsSimilarFonts": [
              "raleway",
              "open sans",
              "nunito sans"
            ],
            "paragraphsUsageGuide": "Use the paragraph font for all body text, captions, and smaller informational text. It pairs well with the heading font to maintain a cohesive serif-based typography system. Ensure sufficient line height and letter spacing for comfortable reading. Text color should primarily be 'secondaryForeground' on 'secondary' backgrounds or 'primaryForeground' on 'primary' backgrounds to maintain contrast and legibility.",
            "paragraphsAccessibilityNotes": "Paragraph text colors meet WCAG AA contrast standards against their respective backgrounds, supporting accessible reading experiences."
          },
          "welcomeSectionTypography": {
            "placement": "Weighted Quadrant",
            "implementation": "The welcome section uses a weighted quadrant layout where large, elegant headings occupy a dominant portion of the left quadrant, balanced by a large image on the right. Smaller text and accent images fill the remaining quadrants, creating a harmonious and dynamic composition. This placement emphasizes the brand’s message while maintaining visual interest and balance."
          },
          "fontSizes": [
            {
              "name": "xs",
              "size": "0.75rem",
              "lineHeight": "1.2",
              "letterSpacing": "0.02em",
              "fontWeight": "400"
            },
            {
              "name": "sm",
              "size": "0.875rem",
              "lineHeight": "1.3",
              "letterSpacing": "0.02em",
              "fontWeight": "400"
            },
            {
              "name": "base",
              "size": "1rem",
              "lineHeight": "1.5",
              "letterSpacing": "0.025em",
              "fontWeight": "400"
            },
            {
              "name": "lg",
              "size": "1.125rem",
              "lineHeight": "1.5",
              "letterSpacing": "0.025em",
              "fontWeight": "400"
            },
            {
              "name": "xl",
              "size": "1.25rem",
              "lineHeight": "1.5",
              "letterSpacing": "0.025em",
              "fontWeight": "600"
            },
            {
              "name": "2xl",
              "size": "1.5rem",
              "lineHeight": "1.4",
              "letterSpacing": "0.02em",
              "fontWeight": "600"
            },
            {
              "name": "3xl",
              "size": "1.875rem",
              "lineHeight": "1.3",
              "letterSpacing": "0.015em",
              "fontWeight": "700"
            },
            {
              "name": "4xl",
              "size": "2.25rem",
              "lineHeight": "1.2",
              "letterSpacing": "0.01em",
              "fontWeight": "700"
            },
            {
              "name": "5xl",
              "size": "3rem",
              "lineHeight": "1.1",
              "letterSpacing": "0em",
              "fontWeight": "700"
            },
            {
              "name": "6xl",
              "size": "3.75rem",
              "lineHeight": "1.1",
              "letterSpacing": "-0.01em",
              "fontWeight": "700"
            },
            {
              "name": "7xl",
              "size": "4.5rem",
              "lineHeight": "1",
              "letterSpacing": "-0.015em",
              "fontWeight": "700"
            },
            {
              "name": "8xl",
              "size": "6rem",
              "lineHeight": "1",
              "letterSpacing": "-0.02em",
              "fontWeight": "700"
            },
            {
              "name": "9xl",
              "size": "8rem",
              "lineHeight": "1",
              "letterSpacing": "-0.025em",
              "fontWeight": "700"
            }
          ]
        },
        "layout": {
          "layoutDna": {
            "densitySpectrum": "Balanced",
            "contrastSpectrum": "Subtle",
            "gridAlignmentSpectrum": "Modular",
            "negativeSpaceUsage": "Generous",
            "textVsImageEmphasis": "Balanced",
            "complexitySpectrum": "Simple & Clean"
          },
          "grid": {
            "compositionApproach": "Modular with asymmetrical blocks",
            "spacing": {
              "columns": "12-column grid",
              "rows": "Defined content rows",
              "gaps": "Consistent medium gaps"
            },
            "margins": "Generous page margins",
            "padding": "Consistent padding within containers"
          }
        },
        "components": {
          "containers": "Containers use solid background colors from the palette with subtle borders or no borders to define sections. They maintain generous padding and margin to create breathing room and visual separation. The 'primary' and 'deepBrown' colors are used for container backgrounds to add depth and warmth.",
          "images": "Images are treated naturally with no heavy filters, emphasizing warm, earthy tones and soft lighting. They are arranged in modular grids with varied aspect ratios to create visual interest while maintaining balance with text.",
          "buttons": "Buttons are minimal and elegant, typically outlined with the 'primary' color and using 'primaryForeground' for text. On hover or active states, buttons may fill with the 'primary' color for emphasis. Secondary buttons use the 'deepBrown' color for outlines and text."
        },
        "graphicElements": {
          "icons": "Icons are minimal or absent, with preference given to typography and photography to communicate the brand message. If used, icons would be simple line styles in 'primary' or 'deepBrown' colors.",
          "illustrations": "No illustrations are present, maintaining a clean and sophisticated look focused on photography.",
          "stickers": "No stickers or badges are used, preserving the minimal and elegant aesthetic."
        }
      },
      "originImagesUrls": [
        "https://wixmp-fe53c9ff592a4da924211f23.wixmp.com/uploads/1752405925400-Screenshot%202025-07-13%20at%2014.24.08%201.jpg"
      ]
    },
    {
      "presetId": "71ea0dab-ab2b-48e6-8153-743280ba2e78",
      "brandIdentity": {
        "designSummary": "This brand identity embraces a monochrome, high-contrast visual style centered on a black background with white foreground elements. The design is minimalistic yet refined, featuring classic serif typography with elegant, high-contrast letterforms that convey sophistication and timelessness. The layout is spacious and balanced, employing generous negative space and a modular grid system to create a clean, editorial aesthetic. Image cards are presented with subtle rotation and rounded corners, adding a dynamic and artistic flair without disrupting the overall minimalism. UI components such as buttons and testimonial containers maintain the monochrome palette with white text and thin white borders, reinforcing the brand's elegant and luxurious tone. This design language is versatile for premium service websites that seek to communicate intimacy, trust, and refinement through a restrained yet impactful visual approach.",
        "toneOfVoice": "Sophisticated, elegant, refined, and trustworthy with a timeless and classic personality.",
        "tones": [
          "Elegant",
          "Sophisticated",
          "Minimalistic",
          "Refined",
          "Timeless",
          "Luxurious",
          "Intimate",
          "Trustworthy",
          "Clean",
          "High-Contrast"
        ],
        "designStyle": {
          "primaryStyle": [
            "Minimalism",
            "Editorial",
            "Classic"
          ],
          "supportingStyles": [
            "Modern",
            "Luxury",
            "Monochrome"
          ]
        },
        "palette": {
          "colors": {
            "primary": "#000000",
            "primaryForeground": "#FFFFFF",
            "secondary": "#FFFFFF",
            "secondaryForeground": "#000000",
            "background": "#000000",
            "customColors": [
              {
                "name": "foreground",
                "value": "#FFFFFF"
              },
              {
                "name": "destructive",
                "value": "#DF3131"
              },
              {
                "name": "destructiveforeground",
                "value": "#FFFFFF"
              }
            ]
          },
          "paletteUsageGuide": "Use the 'primary' black color as the dominant background to create a dramatic and elegant canvas. The 'primaryForeground' white color is used for all text, icons, and UI elements to ensure maximum readability and high contrast. The 'secondary' white color can be used for backgrounds of cards or containers, with 'secondaryForeground' black used for text within those containers to maintain contrast and legibility. This strict monochrome palette supports a timeless and sophisticated brand presence, with careful use of negative space and typography to create visual hierarchy and focus. Avoid introducing additional colors to preserve the minimalistic and editorial tone.",
          "paletteAccessibilityNotes": "The combination of 'primary' black background with 'primaryForeground' white text provides excellent WCAG AA and AAA contrast ratios, ensuring accessibility for all users. Similarly, 'secondary' white backgrounds with 'secondaryForeground' black text also meet high accessibility standards. This palette supports clear readability and user comfort across all text sizes and UI elements."
        },
        "typography": {
          "headings": {
            "font": {
              "role": "Primary Heading Font",
              "fontFamily": "didot-w01-italic",
              "fontJustification": ""
            },
            "headingsSimilarFonts": [
              "baskervillemtw01-smbdit",
              "bodoni-w01-poster",
              "playfair display"
            ],
            "headingsUsageGuide": "Use the heading font for all major titles and section headers to convey elegance and refinement. Pair with the paragraph font to create a clear typographic hierarchy. Maintain ample spacing around headings to enhance readability and visual impact. The italic style adds a classic, editorial feel that complements the monochrome palette. Ensure headings are always displayed in 'primaryForeground' color on 'primary' background or 'secondaryForeground' on 'secondary' backgrounds for optimal contrast.",
            "headingsAccessibilityNotes": "Headings in 'primaryForeground' on 'primary' background and 'secondaryForeground' on 'secondary' background meet WCAG AA contrast requirements, ensuring legibility for users with visual impairments."
          },
          "paragraphs": {
            "font": {
              "role": "Main Body Text Font",
              "fontFamily": "baskervillemtw01-smbdit",
              "fontJustification": ""
            },
            "paragraphsSimilarFonts": [
              "didot-w01-italic",
              "playfair display",
              "cormorantgaramond"
            ],
            "paragraphsUsageGuide": "Use the paragraph font for all body text and smaller informational content. It pairs harmoniously with the heading font to maintain a consistent, elegant typographic voice. Maintain sufficient line height and letter spacing to enhance readability, especially on black backgrounds. Text should always be in 'primaryForeground' on 'primary' background or 'secondaryForeground' on 'secondary' backgrounds to ensure accessibility and visual clarity.",
            "paragraphsAccessibilityNotes": "Body text colors and backgrounds meet WCAG AA contrast standards, supporting comfortable reading experiences for all users."
          },
          "welcomeSectionTypography": {
            "placement": "Centered",
            "implementation": "The welcome section typography is centrally aligned, creating a strong focal point. Large, elegant serif headings dominate the space, with ample negative space around them to emphasize their importance. The text is placed on a solid black background with white foreground text, ensuring maximum contrast and readability. This placement strategy reinforces the brand's sophisticated and timeless personality, drawing the visitor's attention immediately upon landing."
          },
          "fontSizes": [
            {
              "name": "xs",
              "size": "0.75rem",
              "lineHeight": "1.2",
              "letterSpacing": "0.02em",
              "fontWeight": "400"
            },
            {
              "name": "sm",
              "size": "0.875rem",
              "lineHeight": "1.3",
              "letterSpacing": "0.02em",
              "fontWeight": "400"
            },
            {
              "name": "base",
              "size": "1rem",
              "lineHeight": "1.5",
              "letterSpacing": "0.025em",
              "fontWeight": "400"
            },
            {
              "name": "lg",
              "size": "1.125rem",
              "lineHeight": "1.5",
              "letterSpacing": "0.025em",
              "fontWeight": "400"
            },
            {
              "name": "xl",
              "size": "1.25rem",
              "lineHeight": "1.5",
              "letterSpacing": "0.03em",
              "fontWeight": "400"
            },
            {
              "name": "2xl",
              "size": "1.5rem",
              "lineHeight": "1.4",
              "letterSpacing": "0.03em",
              "fontWeight": "400"
            },
            {
              "name": "3xl",
              "size": "1.875rem",
              "lineHeight": "1.3",
              "letterSpacing": "0.035em",
              "fontWeight": "400"
            },
            {
              "name": "4xl",
              "size": "2.25rem",
              "lineHeight": "1.2",
              "letterSpacing": "0.04em",
              "fontWeight": "400"
            },
            {
              "name": "5xl",
              "size": "3rem",
              "lineHeight": "1.1",
              "letterSpacing": "0.04em",
              "fontWeight": "400"
            },
            {
              "name": "6xl",
              "size": "3.75rem",
              "lineHeight": "1.1",
              "letterSpacing": "0.045em",
              "fontWeight": "400"
            },
            {
              "name": "7xl",
              "size": "4.5rem",
              "lineHeight": "1.05",
              "letterSpacing": "0.05em",
              "fontWeight": "400"
            },
            {
              "name": "8xl",
              "size": "6rem",
              "lineHeight": "1.05",
              "letterSpacing": "0.05em",
              "fontWeight": "400"
            },
            {
              "name": "9xl",
              "size": "8rem",
              "lineHeight": "1",
              "letterSpacing": "0.06em",
              "fontWeight": "400"
            }
          ]
        },
        "layout": {
          "layoutDna": {
            "densitySpectrum": "Spacious",
            "contrastSpectrum": "High-Contrast",
            "gridAlignmentSpectrum": "Modular",
            "negativeSpaceUsage": "Generous",
            "textVsImageEmphasis": "Balanced",
            "complexitySpectrum": "Simple & Clean"
          },
          "grid": {
            "compositionApproach": "Modular",
            "spacing": {
              "columns": "12-column grid",
              "rows": "Defined content rows",
              "gaps": "Consistent medium gaps"
            },
            "margins": "Generous page margins",
            "padding": "Consistent padding within containers"
          }
        },
        "components": {
          "containers": "Containers use solid 'secondary' white backgrounds with rounded corners and subtle shadows to create separation from the 'primary' black background. This enhances content focus while maintaining the monochrome palette. Padding is consistent to ensure content clarity and breathing room.",
          "images": "Images are presented in cards with rounded corners and slight rotation for a dynamic, artistic effect. They are framed by white backgrounds to contrast against the black page background, emphasizing the content without adding color distractions.",
          "buttons": "Buttons are minimalistic with thin white borders and white text on a black background. On hover or focus, subtle changes in opacity or border thickness may be used to indicate interactivity, maintaining the monochrome aesthetic."
        },
        "graphicElements": {
          "icons": "Icons, if used, are simple line or solid white shapes consistent with the monochrome palette, ensuring they do not detract from the typography and imagery.",
          "illustrations": "No illustrations are present; the design relies on photography and typography for visual interest.",
          "stickers": "No stickers or badges are used, preserving the clean and elegant visual style."
        }
      },
      "originImagesUrls": [
        "https://wixmp-fe53c9ff592a4da924211f23.wixmp.com/uploads/1750173227756-Group%201000002200.jpg"
      ]
    }
  ],
  "brandBook": {
    "tones": [
      "Futuristic",
      "Innovative",
      "Energetic",
      "Casual",
      "Professional",
      "Tech-savvy",
      "Minimal",
      "High-contrast",
      "Clean",
      "Approachable"
    ],
    "designStyle": {
      "primaryStyle": [
        "Dark Mode",
        "Minimalism",
        "Techno-Futuristic"
      ],
      "supportingStyles": [
        "Geometric",
        "Modular",
        "Neon Accent"
      ]
    },
    "toneOfVoice": "Futuristic, innovative, approachable, and tech-savvy with a casual yet professional personality.",
    "components": {
      "images": "Images are minimal or abstract, often replaced by graphic elements or logos. When present, images are framed within rounded containers or circular shapes to maintain design consistency.",
      "buttons": "Buttons are rounded with solid backgrounds in 'accentNeonGreen' or outlined in white. Text on buttons is white or black depending on background for maximum contrast. Buttons have clear hover states and are sized for easy interaction.",
      "containers": "Containers have rounded corners with solid backgrounds in black, neon green, blue, or peach depending on context. They maintain consistent padding and spacing, creating modular blocks that organize content clearly. The use of bright accent backgrounds for interactive or navigational containers draws user attention effectively."
    },
    "typography": {
      "headings": {
        "font": {
          "role": "Primary Heading Font",
          "fontFamily": "rubik-v2",
          "fontJustification": ""
        },
        "headingsUsageGuide": "Use the heading font in large sizes with bold weight to create impactful titles and section headers. Mix white and 'accentNeonGreen' colors to highlight key words or phrases, enhancing visual hierarchy. Pair headings with paragraph fonts by maintaining clear spacing and contrast. Ensure headings remain legible on dark backgrounds by using 'primaryForeground' or 'accentNeonGreen' colors. Avoid overly condensed or decorative styles to preserve clarity.",
        "headingsSimilarFonts": [
          "work-sans-v2",
          "open sans",
          "poppins-v2"
        ],
        "headingsAccessibilityNotes": "Headings in 'primaryForeground' white or 'accentNeonGreen' on 'primary' black background meet WCAG AAA contrast standards, ensuring excellent readability for all users."
      },
      "fontSizes": [
        {
          "name": "xs",
          "size": "0.75rem",
          "letterSpacing": "0.02em",
          "lineHeight": "1.2",
          "fontWeight": "400"
        },
        {
          "name": "sm",
          "size": "0.875rem",
          "letterSpacing": "0.02em",
          "lineHeight": "1.3",
          "fontWeight": "400"
        },
        {
          "name": "base",
          "size": "1rem",
          "letterSpacing": "0.025em",
          "lineHeight": "1.5",
          "fontWeight": "400"
        },
        {
          "name": "lg",
          "size": "1.125rem",
          "letterSpacing": "0.025em",
          "lineHeight": "1.5",
          "fontWeight": "500"
        },
        {
          "name": "xl",
          "size": "1.25rem",
          "letterSpacing": "0.03em",
          "lineHeight": "1.5",
          "fontWeight": "600"
        },
        {
          "name": "2xl",
          "size": "1.5rem",
          "letterSpacing": "0.03em",
          "lineHeight": "1.4",
          "fontWeight": "700"
        },
        {
          "name": "3xl",
          "size": "1.875rem",
          "letterSpacing": "0.035em",
          "lineHeight": "1.3",
          "fontWeight": "700"
        },
        {
          "name": "4xl",
          "size": "2.25rem",
          "letterSpacing": "0.04em",
          "lineHeight": "1.2",
          "fontWeight": "800"
        },
        {
          "name": "5xl",
          "size": "3rem",
          "letterSpacing": "0.04em",
          "lineHeight": "1.1",
          "fontWeight": "800"
        },
        {
          "name": "6xl",
          "size": "3.75rem",
          "letterSpacing": "0.045em",
          "lineHeight": "1.1",
          "fontWeight": "900"
        },
        {
          "name": "7xl",
          "size": "4.5rem",
          "letterSpacing": "0.05em",
          "lineHeight": "1.05",
          "fontWeight": "900"
        },
        {
          "name": "8xl",
          "size": "6rem",
          "letterSpacing": "0.05em",
          "lineHeight": "1.05",
          "fontWeight": "900"
        },
        {
          "name": "9xl",
          "size": "8rem",
          "letterSpacing": "0.06em",
          "lineHeight": "1",
          "fontWeight": "900"
        }
      ],
      "paragraphs": {
        "font": {
          "role": "Main Body Text Font",
          "fontFamily": "rubik-v2",
          "fontJustification": ""
        },
        "paragraphsUsageGuide": "Use the paragraph font in regular weight and moderate sizes for body text, descriptions, and navigation links. Maintain high contrast by using 'primaryForeground' white on 'primary' black or 'secondary' blue backgrounds. Ensure sufficient line height and letter spacing for comfortable reading. Pair paragraphs with bold headings to create clear content hierarchy. Avoid using accent colors for large blocks of text to maintain readability.",
        "paragraphsSimilarFonts": [
          "work-sans-v2",
          "open sans",
          "poppins-v2"
        ],
        "paragraphsAccessibilityNotes": "Paragraph text in 'primaryForeground' white on 'primary' black or 'secondary' blue backgrounds meets WCAG AA or higher contrast standards, supporting accessibility."
      },
      "welcomeSectionTypography": {
        "placement": "Centered",
        "implementation": "The welcome section uses a large, bold heading centered horizontally and vertically within the viewport. The heading text is split with a mix of 'primaryForeground' white and 'accentNeonGreen' colors to emphasize key words. Supporting text is placed below the heading in smaller white font, maintaining strong contrast. Interactive badges and date tags are positioned near the heading with rounded shapes and neon green backgrounds, reinforcing the futuristic theme. The overall typographic placement creates a strong focal point that immediately communicates the event's identity."
      }
    },
    "originImagesUrls": [
      "https://wixmp-fe53c9ff592a4da924211f23.wixmp.com/uploads/1750335929106-Screenshot%202025-06-05%20at%2015.42.54%201.png"
    ],
    "layout": {
      "grid": {
        "margins": "Generous page margins",
        "padding": "Consistent padding within containers",
        "spacing": {
          "gaps": "Consistent medium gaps",
          "rows": "Defined content rows",
          "columns": "12-column grid"
        },
        "compositionApproach": "Column-based"
      },
      "layoutDna": {
        "contrastSpectrum": "High-Contrast",
        "densitySpectrum": "Balanced",
        "textVsImageEmphasis": "Text-Focused",
        "complexitySpectrum": "Simple & Clean",
        "gridAlignmentSpectrum": "Strict Grid",
        "negativeSpaceUsage": "Generous"
      }
    },
    "graphicElements": {
      "icons": "Icons are simple, modern, and use the 'accentNeonGreen' color to stand out against dark backgrounds. They have rounded shapes consistent with the overall design language and are used sparingly to support navigation and calls to action.",
      "stickers": "Badges and stickers use rounded pill shapes with 'accentNeonGreen' backgrounds and black text, providing clear, friendly labels for event types and dates.",
      "illustrations": "No prominent illustrations are used; the design relies on abstract shapes and logos to convey brand identity."
    },
    "designSummary": "The design features a modern dark mode aesthetic with a solid black background that creates a sleek and immersive environment. Vibrant neon green and bright blue accent colors energize the interface, highlighting interactive elements and branding. Typography is geometric, clean, and sans-serif, with large, bold headings that mix white and neon green to emphasize key messages. The layout is spacious and balanced, using a centered column grid with generous negative space and rounded corners on containers and buttons to soften the high-tech feel. The footer employs a modular grid with distinct colored blocks, maintaining visual consistency and clarity. Overall, the design conveys a cutting-edge, digital culture vibe suitable for a gaming or tech conference, combining high contrast, minimalism, and vibrant accents for a friendly yet professional look.",
    "palette": {
      "colors": {
        "background": "#000000",
        "secondary": "#2B5FFF",
        "customColors": [
          {
            "name": "accentneongreen",
            "value": "#3EFFB8"
          },
          {
            "name": "accentpeach",
            "value": "#FFCCB3"
          },
          {
            "name": "foreground",
            "value": "#000000"
          },
          {
            "name": "destructive",
            "value": "#DF3131"
          },
          {
            "name": "destructiveforeground",
            "value": "#ffffff"
          }
        ],
        "secondaryForeground": "#FFFFFF",
        "primaryForeground": "#FFFFFF",
        "primary": "#000000"
      },
      "paletteUsageGuide": "Use the 'primary' black color as the main background to create a sleek, immersive environment. The 'primaryForeground' white color is ideal for main text and icons to ensure maximum readability and contrast. The 'secondary' blue color should be used for branding elements such as color blocks,UI cards, repeters logos and footer backgrounds, paired with 'secondaryForeground' white for text and icons. The 'accentNeonGreen' color is reserved for interactive elements like buttons, badges, and icons to draw user attention and convey energy and innovation. The 'accentPeach' color provides a subtle warm contrast in secondary UI elements such as social media icon backgrounds, balancing the cool palette. Combine these colors thoughtfully to maintain high contrast and accessibility, ensuring that text and interactive elements stand out clearly against backgrounds.",
      "paletteAccessibilityNotes": "The combination of 'primaryForeground' white on 'primary' black background meets WCAG AAA contrast standards for text readability. The 'accentNeonGreen' on black also provides excellent contrast, suitable for buttons and badges. The 'secondaryForeground' white on 'secondary' blue background meets WCAG AA standards for text. The 'accentPeach' on blue background should be used for non-critical elements or icons to maintain sufficient contrast. Overall, the palette supports strong accessibility compliance for text and interactive elements."
    }
  },
  "initialPrompt": "Build a cinematic, interactive, multi-page fashion portfolio website for Khushi Lohchab using Wix ADI. Use all text and project descriptions from the provided PDF. Do NOT auto-generate media—create editable placeholders for all images and videos, with optional demo images and demo video if available. \n\nPAGE 1 – HOME: Fullscreen hero video placeholder, enter animation with center text 'KHUSHI LOHCHAB – Fashion Designer' and ENTER button, top navigation (Projects, About, Contact), floating dynamic dock (blurred glass, rounded corners, scroll indicator, expands on hover, clickable to Projects).\n\nPAGE 2 – PROJECT STREAM 1: Vertical project stream with parallax scrolling, floating images (editable placeholders, optional demo images), projects: The Florentine Hourglass Corset, Flying Shark Womenswear, Zivame SS26 (Pit Stop Glow).\n\nPAGE 3 – PROJECT STREAM 2: Same cinematic behavior, projects: Raymond Menswear Collection, Creative Pattern Making, Zero Waste Top, Swan Top, Petal Skirt.\n\nPAGE 4 – PROJECT STREAM 3: Same cinematic behavior, projects: Bhawna Rao Couture – Embroidery + Crystals, Resha Weaves – Kinetic Weave Saree, Abyssal Bloom (Biomimicry Couture), Luminescence of Decay.\n\nPROJECT PAGE TEMPLATE: Multiple large editable image slots, parallax scrolling, overlapping text, floating dock (Home + Similar Projects), optional demo images.\n\nABOUT PAGE: Two-column layout, left portrait image placeholder, right PDF content (philosophy, education, skills, experience, contact info), minimal luxury serif/sans-serif mix.\n\nCONTACT PAGE: Editable header image placeholder, contact form (Name, Email, Message), email: Khushilohchab3@gmail.com, phone: 9518845008, Behance link, address from PDF, floating dynamic dock remains.\n\nMOODBOARD (Optional): Grid of editable image placeholders, optional demo images (Floral Heritage, Vaporwave Velocity, Kinetic Weave, Abyssal Zone, Nature/Decay).\n\nDESIGN SYSTEM: Colors—Ivory, Rose-beige, Soft pink (#f7d6f4), Sage (#c0d7a8), Black accents. Fonts—Headings: Playfair Display, Body: Inter or Work Sans, wide spacing, luxury magazine aesthetic. Effects—Smooth fade transitions, parallax scrolling, hover image expansion, floating dynamic dock, overlapping images, editorial white space.",
  "status": "READY",
  "revision": "11",
  "createdDate": "2025-11-25T04:23:23.484Z",
  "updatedDate": "2025-11-25T04:27:24.547Z",
  "attachments": {
    "contentImagesUrls": [
      "https://120ae81a-1d65-4b15-8daa-779a4d1026d2.usrfiles.com/ugd/41c551_72f393aff87d41e5ac6c57c8bfe1edaa.pdf"
    ],
    "inspirationImagesUrls": []
  },
  "selectedBrandingPresetId": "cb8e0452-ae91-4eda-9dc5-2eaad304dba7",
  "plan": "{\n  \"sections\": [\n    {\n      \"id\": \"overview\",\n      \"title\": \"## Overview\",\n      \"content\": \"This plan outlines a cinematic, interactive, multi-page fashion portfolio website for Khushi Lohchab. It will feature distinct project streams, detailed project pages, an 'About' section, and a contact page, all designed with a luxury magazine aesthetic using specified colors and fonts.\"\n    },\n    {\n      \"id\": \"key-features\",\n      \"title\": \"## Key features\",\n      \"content\": \"- **View Homepage**: Displays a fullscreen hero video placeholder with an entry animation, title, and navigation.\\n- **View Project Listing**: Presents projects in vertical streams with parallax scrolling and floating image placeholders.\\n- **View Project Details**: Shows detailed information for individual projects with large image slots, parallax scrolling, and overlapping text.\\n- **View About Information**: Displays the designer's philosophy, education, skills, and experience in a two-column layout with a portrait image placeholder.\\n- **Submit Contact Form**: Allows visitors to send inquiries via a form, with contact details and links provided.\\n- **View Moodboard**: Showcases a grid of image placeholders for inspiration.\",\n      \"metadata\": [\n        { \"id\": \"view-homepage\", \"name\": \"View Homepage\" },\n        { \"id\": \"view-project-listing\", \"name\": \"View Project Listing\" },\n        { \"id\": \"view-project-details\", \"name\": \"View Project Details\" },\n        { \"id\": \"view-about-information\", \"name\": \"View About Information\" },\n        { \"id\": \"submit-contact-form\", \"name\": \"Submit Contact Form\" },\n        { \"id\": \"view-moodboard\", \"name\": \"View Moodboard\" }\n      ]\n    },\n    {\n      \"id\": \"structure\",\n      \"title\": \"## Structure\",\n      \"content\": \"- **Homepage**: Features the hero video, entry animation, and top navigation.\\n- **Projects Page**: Hosts the three vertical project streams.\\n- **Project Detail Page**: A template for displaying individual project details.\\n- **About Page**: Contains the designer's biography and professional information.\\n- **Contact Page**: Includes the contact form and essential contact details.\\n- **Moodboard Page**: Displays the curated image grid.\"\n    }\n  ],\n  \"apps\": [\n    {\n      \"id\": \"wix-cms\",\n      \"keyFeatures\": [\n        { \"id\": \"view-homepage\", \"name\": \"View Homepage\" },\n        { \"id\": \"view-project-listing\", \"name\": \"View Project Listing\" },\n        { \"id\": \"view-project-details\", \"name\": \"View Project Details\" },\n        { \"id\": \"view-about-information\", \"name\": \"View About Information\" },\n        { \"id\": \"submit-contact-form\", \"name\": \"Submit Contact Form\" },\n        { \"id\": \"view-moodboard\", \"name\": \"View Moodboard\" }\n      ]\n    }\n  ],\n  \"version\": \"2.5\"\n}",
  "designerData": {
    "designerId": "",
    "designerName": "",
    "selectionMethod": "UNSELECTED"
  }
}